In [3]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data,index=['A','B','C','D','E'])
series

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [4]:
# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
#     Fill it with 5 sample student records and display the top 3 rows using head().

dict_data={
    "Student_Name":['AD','AB','AC','AE','AK'],
    "Maths":[90,98,87,80,89],
    "Science":[78,79,83,85,74],
    "English":[88,67,75,89,87]
}

df=pd.DataFrame(dict_data)
df

  Student_Name  Maths  Science  English
0           AD     90       78       88
1           AB     98       79       89
2           AC     87       83       86
3           AE     80       85       89
4           AK     89       74       87

In [47]:
# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.
df1=pd.read_csv("Final_output.csv")
df1

df1.shape

df1.columns

Index(['Name', 'Age', 'Salary', 'Ranking'], dtype='object')

In [20]:
# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.

df['Total_Marks']=df['Maths']+df['Science']+df['English']
df

df['Average_Marks']=df['Total_Marks']/3
df

  Student_Name  Maths  Science  English  Total_Marks  Average_Marks
0           AD     90     78.0       88        256.0      85.333333
1           AB     98     79.0       89        266.0      88.666667
2           AC     87     79.0       86        252.0      84.000000
3           AE     80     85.0       89        254.0      84.666667
4           AK     89     74.0       87        250.0      83.333333

In [21]:
# 5. Introduce a missing value (NaN) in the "Science" column and then:

df.loc[2,'Science']=None
df

  Student_Name  Maths  Science  English  Total_Marks  Average_Marks
0           AD     90     78.0       88        256.0      85.333333
1           AB     98     79.0       89        266.0      88.666667
2           AC     87      NaN       86        252.0      84.000000
3           AE     80     85.0       89        254.0      84.666667
4           AK     89     74.0       87        250.0      83.333333

In [22]:
# (a) Identify missing values using isnull()
df.isna()

   Student_Name  Maths  Science  English  Total_Marks  Average_Marks
0         False  False    False    False        False          False
1         False  False    False    False        False          False
2         False  False     True    False        False          False
3         False  False    False    False        False          False
4         False  False    False    False        False          False

In [23]:
#(b) Replace the missing value with the column mean using fillna().
df['Science']=df['Science'].fillna(df['Science'].mean())
df

  Student_Name  Maths  Science  English  Total_Marks  Average_Marks
0           AD     90     78.0       88        256.0      85.333333
1           AB     98     79.0       89        266.0      88.666667
2           AC     87     79.0       86        252.0      84.000000
3           AE     80     85.0       89        254.0      84.666667
4           AK     89     74.0       87        250.0      83.333333

In [24]:
# 6. Filter and display all students whose "Average" score is greater than 75.

df[df['Average_Marks']>75]

  Student_Name  Maths  Science  English  Total_Marks  Average_Marks
0           AD     90     78.0       88        256.0      85.333333
1           AB     98     79.0       89        266.0      88.666667
2           AC     87     79.0       86        252.0      84.000000
3           AE     80     85.0       89        254.0      84.666667
4           AK     89     74.0       87        250.0      83.333333

In [27]:
# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.

sort=df.sort_values(by='Total_Marks',ascending=False)
sort[0:3]

  Student_Name  Maths  Science  English  Total_Marks  Average_Marks
1           AB     98     79.0       89        266.0      88.666667
0           AD     90     78.0       88        256.0      85.333333
3           AE     80     85.0       89        254.0      84.666667

In [36]:
# 8. Group students based on their "English" score range (like above or below 70)
#     and find the mean of "Maths" and "Science" marks for each group.

group1=df.groupby(df['English']>70)[['Science','Maths']].mean()
group1

         Science  Maths
English
True        79.0   88.8

In [38]:
group2=df.groupby(df['English']<70)[['Science','Maths']].mean()
group2

         Science  Maths
English
False       79.0   88.8

In [41]:
# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score.
frame1={
    "Student_Name":['AD','AB','AC','AE','AK'],
    "Total_Marks":[287,267,243,298,221]
}

frame2={
    "Student_Name":['AD','AB','AC','AE','AK'],
    "Sports_Score":[98,87,67,89,56]
}

frame1_df = pd.DataFrame(frame1)
frame2_df = pd.DataFrame(frame2)
merg = pd.merge(frame1_df, frame2_df, on="Student_Name")
merg['Overall_Score'] = merg['Total_Marks'] + merg['Sports_Score']
merg

  Student_Name  Total_Marks  Sports_Score  Overall_Score
0           AD          287            98            385
1           AB          267            87            354
2           AC          243            67            310
3           AE          298            89            387
4           AK          221            56            277

In [44]:
# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to define path)
#     and verify if the file is successfully created using os.path.exists().

import os

save=merg.to_csv("Student_Data.csv",index=False)
path=os.getcwd()
path

'c:\\Users\\Admin\\Desktop\\Python Basics'